       01  DFHCOMMAREA.                   
           05 COM-NUMB    PIC X(6).       
           05 COM-NAME    PIC X(20).      
           05 COM-ADDRX   PIC X(20).      
           05 COM-PHONE   PIC X(8).       
           05 COM-AMOUNT  PIC X(8).       
           05 COM-HORA    PIC X(8). 
